src/Catalogs/ИТСервисы_ЛицензииПО/ИТСервисы_ЛицензииПО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИТСервисы_ЛицензииПО</name>
  <attributes>
    <name>ПрограммноеОбеспечение</name>
    <type>
      <types>CatalogRef.ИТСервисы_ПрограммныеОбеспечения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЛицензирования</name>
    <type>
      <types>EnumRef.ИТСервисы_ТипыЛицензирования</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихМест</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/ИТСервисы_ТипыЛицензирования/ИТСервисы_ТипыЛицензирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_ТипыЛицензирования</name>
  <enumValues>
    <name>Подписка</name>
  </enumValues>
  <enumValues>
    <name>Бессрочная</name>
  </enumValues>
  <enumValues>
    <name>OpenSource</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ИТСервисы_ЛицензииПО/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
    	Объект.ДатаОкончания = Дата(3999, 12, 31, 23, 59, 59);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьВидимостьДатыОкончанияИДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЛицензированияПриИзменении(Элемент)
	
	ОбновитьВидимостьДатыОкончанияИДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьДатыОкончанияИДоговора()
	
	ТипЛицензии = Объект.ТипЛицензирования;
	
	СкрытьДату = ТипЛицензии = ПредопределенноеЗначение("Перечисление.ИТСервисы_ТипыЛицензирования.Бессрочная")
	ИЛИ ТипЛицензии = ПредопределенноеЗначение("Перечисление.ИТСервисы_ТипыЛицензирования.OpenSource");
	
	СкрытьДоговор = ТипЛицензии = ПредопределенноеЗначение("Перечисление.ИТСервисы_ТипыЛицензирования.OpenSource");
	
	Если СкрытьДату Тогда
		Объект.ДатаОкончания = Неопределено;
	КонецЕсли;
	
	Если СкрытьДоговор Тогда
		Объект.Договор = Неопределено;
	КонецЕсли;
	
	Элементы.ДатаОкончания.Видимость = НЕ СкрытьДату;
	Элементы.Договор.Видимость = НЕ СкрытьДоговор;
	
КонецПроцедуры
